#+Title:   My use-package configuration in org-mode
#+Author:  Felix Brilej
#+STARTUP: showall

*** Seti-theme workaround
    I had to uncomment two lines in the official package for this theme. If i dont do so the
    html-export breaks.
    #+BEGIN_SRC sh :results drawer :tangle no
    # Here are the two lines
    grep "breaks" ~/.emacs.d/elpa/seti-theme-20161208.836/seti-theme.el
    #+END_SRC

    #+RESULTS:
    :RESULTS:
       ;; `(font-lock-comment-delimiter-face ((t (:inherit (font-lock-comment-face))))) ;;disabled because it breaks the html-export
       ;; `(font-lock-comment-face ((t (:foreground ,text-3)))) ;;disabled because it breaks the html-export
    :END:

    Apart from that i now (<2017-04-13 Do>) get an error that the face "bold" does not exist. A
    bunch of settings in the theme inherit from this face. I guess i have to fix this or use a
    different theme.

